In [1]:
#import Library
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

In [5]:
city = ["Dhaka","Barishal","Khulna"]
city

['Dhaka', 'Barishal', 'Khulna']

In [6]:
df = pd.DataFrame(city)
df

          0
0     Dhaka
1  Barishal
2    Khulna

In [8]:
row, col = df.shape

In [9]:
row

3

In [10]:
df.shape

(3, 1)

In [12]:
df = pd.DataFrame(city, columns=['city_in_Europe'])
df

  city_in_Europe
0          Dhaka
1       Barishal
2         Khulna

In [13]:
df = pd.DataFrame(city, columns=['city_in_Europe'],index=['c1','c2','c3'])
df

   city_in_Europe
c1          Dhaka
c2       Barishal
c3         Khulna

In [14]:
df = pd.DataFrame(city, columns=['city_in_Bangladesh'],index=['c1','c2','c3'])
df

   city_in_Bangladesh
c1              Dhaka
c2           Barishal
c3             Khulna

In [15]:
city2 = ["jessore","Magura","Feni"]
df2 = pd.DataFrame(zip(city,city2), columns=['City1','city2'])
df2

      City1    city2
0     Dhaka  jessore
1  Barishal   Magura
2    Khulna     Feni

In [17]:
df2.shape

(3, 2)

In [19]:
city3 = [['Bangladesh','Dhaka'],['India','Delhi']]

In [20]:
city3

[['Bangladesh', 'Dhaka'], ['India', 'Delhi']]

In [21]:
df4 = pd.DataFrame(city3)

In [22]:
df4

            0      1
0  Bangladesh  Dhaka
1       India  Delhi

In [23]:
df4 = pd.DataFrame(city3,columns=['Country','city'])
df4

      Country   city
0  Bangladesh  Dhaka
1       India  Delhi

In [4]:
country = {"bangladesh","India","Nepal"}
country

{'India', 'Nepal', 'bangladesh'}

In [5]:
country1={"Brazil","Germaany","Spain"}
country1

{'Brazil', 'Germaany', 'Spain'}

In [6]:
dict = {
    "country":country,
    "country1":country1

}
dict

{'country': {'India', 'Nepal', 'bangladesh'},
 'country1': {'Brazil', 'Germaany', 'Spain'}}

In [7]:
df5 = pd.DataFrame(dict)

NameError: name 'pd' is not defined

In [8]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\asus\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import pandas as pd

In [12]:

dict1 = {
    'city1': "New York",
    'city2': "Los Angeles"
}
dict1

{'city1': 'New York', 'city2': 'Los Angeles'}

In [14]:
import pandas as pd  

dict1 = {
    'city1': ["New York"],  # Wrap values in lists
    'city2': ["Los Angeles"]
}

df5 = pd.DataFrame(dict1)  
print(df5)

      city1        city2
0  New York  Los Angeles

In [16]:
#importing excel file
df = pd.read_csv("nasdaq100.csv")

In [17]:
df

   Date;Starting (USD);Ending (USD)
0              01.01.24;16800;16500
1              01.12.23;15900;16100
2              01.11.23;15800;15300
3              01.10.23;16100;16200
4              01.09.23;16300;15700
5              01.08.23;16800;16400
6              01.07.23;15900;16200
7              01.06.23;15800;15500
8              01.05.23;16150;16100
9              01.04.23;16300;15800
10             01.03.23;16200;16200
11             01.02.23;16300;15700